protogia/avr-descriptionfiles-4-nim/svd/ATmega128RFA1.atdf.svd
        <register>
          <name>VREG_CTRL</name>
          <description>Voltage Regulator Control and Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DVDD_OK</name>
              <description>DVDD Supply Voltage Valid</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIGITAL_VOLTAGE_REGULATOR_DISABLED_OR_SUPPLY_VOLTAGE_NOT_STABLE</name>
                  <description>Digital voltage regulator disabled or supply voltage not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_SUPPLY_VOLTAGE_HAS_SETTLED</name>
                  <description>Digital supply voltage has settled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVREG_EXT</name>
              <description>Use External DVDD Regulator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVDD_INT</name>
                  <description>Internal DVDD voltage regulator for the digital section is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVDD_EXT</name>
                  <description>Internal DVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the digital section.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDD_OK</name>
              <description>AVDD Supply Voltage Valid</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANALOG_VOLTAGE_REGULATOR_DISABLED_OR_SUPPLY_VOLTAGE_NOT_STABLE</name>
                  <description>Analog voltage regulator disabled or supply voltage not stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANALOG_SUPPLY_VOLTAGE_HAS_SETTLED</name>
                  <description>Analog supply voltage has settled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVREG_EXT</name>
              <description>Use External AVDD Regulator</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVDD_INT</name>
                  <description>Internal AVDD voltage regulator for the analog section is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVDD_EXT</name>
                  <description>Internal AVDD voltage regulator is disabled; use external regulated 1.8V supply voltage for the analog section.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XAH_CTRL_0</name>
          <description>Transceiver Extended Operating Mode Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLOTTED_OPERATION</name>
              <description>Set Slotted Acknowledgment</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOTTED_OP_DIS</name>
                  <description>The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOTTED_OP_EN</name>
                  <description>The transmission of an acknowledgment frame has to be controlled by the microcontroller.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_CSMA_RETRIES</name>
              <description>Maximum Number of CSMA-CA Procedure Repetition Attempts</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REPETITION_OF_CSMA_CA_PROCEDURE</name>
                  <description>No repetition of CSMA-CA procedure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_REPETITION_OF_CSMA_CA_PROCEDURE</name>
                  <description>One repetition of CSMA-CA procedure</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE_REPETITIONS_HIGHEST_IEEE_802_15_4_COMPLIANT_VALUE</name>
                  <description>Five repetitions (highest IEEE 802.15.4 compliant value)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMMEDIATE_FRAME_RE_TRANSMISSION_WITHOUT_PERFORMING_CSMA_CA</name>
                  <description>Immediate frame re-transmission without performing CSMA-CA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_FRAME_RETRIES</name>
              <description>Maximum Number of Frame Re-transmission Attempts</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_NOT_ATTEMPTED</name>
                  <description>Retransmission of frame is not attempted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_ONCE</name>
                  <description>Retransmission of frame is attempted once.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRANSMISSION_OF_FRAME_IS_ATTEMPTED_15_TIMES</name>
                  <description>Retransmission of frame is attempted 15 times.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XAH_CTRL_1</name>
          <description>Transceiver Acknowledgment Frame Control Register 1</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AACK_PROM_MODE</name>
              <description>Enable Promiscuous Mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_ACK_TIME</name>
              <description>Reduce Acknowledgment Time</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AACK_ACK_TIME_12_SYM</name>
                  <description>12 symbols acknowledgment time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AACK_ACK_TIME_2_SYM</name>
                  <description> 2 symbols acknowledgment time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AACK_UPLD_RES_FT</name>
              <description>Process Reserved Frames</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_FLTR_RES_FT</name>
              <description>Filter Reserved Frames</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC_CTRL</name>
          <description>Crystal Oscillator Control Register</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XTAL_TRIM</name>
              <description>Crystal Oscillator Load Capacitance Trimming</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL_TRIM_MIN</name>
                  <description>0.0 pF, trimming capacitors disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x1</name>
                  <description>0.3 pF, trimming capacitor switched on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x2</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_TRIM_MAX</name>
                  <description>4.5 pF, trimming capacitor switched on</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_MODE</name>
              <description>Crystal Oscillator Operating Mode</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERNAL_CRYSTAL_OSCILLATOR_DISABLED_USE_EXTERNAL_REFERENCE_FREQUENCY</name>
                  <description>Internal crystal oscillator disabled; use external reference frequency.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL_CRYSTAL_OSCILLATOR_ENABLED_AMPLITUDE_REGULATION_OF_OSCILLATION_ENABLED</name>
                  <description>Internal crystal oscillator enabled; amplitude regulation of oscillation enabled.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
