protogia/avr-descriptionfiles-4-nim/svd/ATmega128RFA1.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USART1_SPI</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x000000C8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UCSR1A</name>
          <description>USART1 MSPIM Control and Status Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UDRE1</name>
              <description>USART Data Register Empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXC1</name>
              <description>USART Transmit Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXC1</name>
              <description>USART Receive Complete</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1B</name>
          <description>USART1 MSPIM Control and Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXEN1</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN1</name>
              <description>Receiver Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDRIE1</name>
              <description>USART Data Register Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCIE1</name>
              <description>TX Complete Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCIE1</name>
              <description>RX Complete Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1C</name>
          <description>USART1 MSPIM Control and Status Register C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UCPOL1</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPHA1</name>
              <description>Clock Phase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDORD1</name>
              <description>Data Order</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00000060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCSR</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDP</name>
              <description>Watchdog Timer Prescaler Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_2K</name>
                  <description>Oscillator Cycles 2K</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_4K</name>
                  <description>Oscillator Cycles 4K</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_8K</name>
                  <description>Oscillator Cycles 8K</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_16K</name>
                  <description>Oscillator Cycles 16K</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_32K</name>
                  <description>Oscillator Cycles 32K</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_64K</name>
                  <description>Oscillator Cycles 64K</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_128K</name>
                  <description>Oscillator Cycles 128K</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_256K</name>
                  <description>Oscillator Cycles 256K</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timeout Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>